# تعريف أسئلة بيك
beck_questions = [
    {
        "question": "حاسس/ة إزاي دلوقتي؟",
        "answers": [
            {"text": "مش حاسس/ة بحزن خالص", "score": 0},
            {"text": "حزين/ة شوية", "score": 1},
            {"text": "حزين/ة طول الوقت ومش عارف/ة أخرج من المود ده", "score": 2},
            {"text": "حزين/ة جداً لدرجة مش قادر/ة أستحمل", "score": 3}
        ]
    },
    {
        "question": "شايف/ة المستقبل إزاي؟",
        "answers": [
            {"text": "متفائل/ة زي ما أنا عادةً", "score": 0},
            {"text": "مش متفائل/ة أوي زي الأول", "score": 1},
            {"text": "حاسس/ة إن مفيش حاجة حلوة جاية", "score": 2},
            {"text": "حاسس/ة إن المستقبل ميئوس منه وإن كل حاجة هتبقى أسوأ", "score": 3}
        ]
    },
    {
        "question": "بتقيم/ي نفسك إزاي؟",
        "answers": [
            {"text": "مش حاسس/ة إني فاشل/ة", "score": 0},
            {"text": "حاسس/ة إني بفشل أكتر من الناس العادية", "score": 1},
            {"text": "لما بابص على حياتي باشوف فشل كتير", "score": 2},
            {"text": "حاسس/ة إني إنسان/ة فاشل/ة خالص", "score": 3}
        ]
    },
    {
        "question": "بتستمتع/ي بالحاجات اللي بتعملها/تعمليها إزاي؟",
        "answers": [
            {"text": "بستمتع بالحاجات زي الأول", "score": 0},
            {"text": "مش بستمتع بالحاجات زي الأول", "score": 1},
            {"text": "معدتش باخد متعة حقيقية من أي حاجة", "score": 2},
            {"text": "كل حاجة بقت مملة ومش بستمتع بأي حاجة", "score": 3}
        ]
    },
    {
        "question": "بتحس/ي بذنب؟",
        "answers": [
            {"text": "مش حاسس/ة بذنب خاص", "score": 0},
            {"text": "بحس بالذنب في أوقات كتير", "score": 1},
            {"text": "بحس بالذنب معظم الوقت", "score": 2},
            {"text": "حاسس/ة بالذنب طول الوقت", "score": 3}
        ]
    },
    {
        "question": "حاسس/ة إنك تستاهل/ي عقاب؟",
        "answers": [
            {"text": "مش حاسس/ة إني بتعاقب", "score": 0},
            {"text": "حاسس/ة إني ممكن أتعاقب", "score": 1},
            {"text": "متوقع/ة إني هتعاقب", "score": 2},
            {"text": "حاسس/ة إني بتعاقب فعلاً", "score": 3}
        ]
    },
    {
        "question": "إيه رأيك في نفسك؟",
        "answers": [
            {"text": "مش خايب/ة أملي في نفسي", "score": 0},
            {"text": "خايب/ة أملي في نفسي", "score": 1},
            {"text": "مش عاجبني نفسي خالص", "score": 2},
            {"text": "بكره نفسي", "score": 3}
        ]
    },
    {
        "question": "بتلوم/ي نفسك على كل حاجة؟",
        "answers": [
            {"text": "مش بلوم نفسي أكتر من العادي", "score": 0},
            {"text": "بلوم نفسي على حاجات كتير", "score": 1},
            {"text": "بلوم نفسي على كل حاجة وحشة بتحصل", "score": 2},
            {"text": "بلوم نفسي على كل حاجة", "score": 3}
        ]
    },
    {
        "question": "بتفكر/ي في الانتحار؟",
        "answers": [
            {"text": "معنديش أي أفكار انتحارية", "score": 0},
            {"text": "عندي أفكار انتحارية بس مش هعمل كده", "score": 1},
            {"text": "نفسي أنتحر", "score": 2},
            {"text": "هنتحر لو لقيت فرصة", "score": 3}
        ]
    },
    {
        "question": "بتعيط/ي كتير؟",
        "answers": [
            {"text": "مش بعيط أكتر من الأول", "score": 0},
            {"text": "بعيط أكتر من الأول", "score": 1},
            {"text": "بعيط على أتفه سبب دلوقتي", "score": 2},
            {"text": "كنت بعرف أعيط، دلوقتي مش قادر/ة حتى أعيط", "score": 3}
        ]
    },
    {
        "question": "بتتعصب/ي بسرعة؟",
        "answers": [
            {"text": "مش بتعصب أكتر من الأول", "score": 0},
            {"text": "بتعصب/بتضايق بسرعة عن الأول", "score": 1},
            {"text": "بتعصب/بتضايق طول الوقت", "score": 2},
            {"text": "مبقتش بتعصب/أتضايق من الحاجات اللي كانت بتعصبني", "score": 3}
        ]
    },
    {
        "question": "اهتمامك بالناس عامل إزاي؟",
        "answers": [
            {"text": "اهتمامي بالناس زي ما هو", "score": 0},
            {"text": "مش مهتم/ة بالناس زي الأول", "score": 1},
            {"text": "فقدت معظم اهتمامي بالناس", "score": 2},
            {"text": "فقدت اهتمامي بالناس خالص", "score": 3}
        ]
    },
    {
        "question": "بتاخد/ي قرارات إزاي؟",
        "answers": [
            {"text": "باخد قرارات زي الأول", "score": 0},
            {"text": "بأجل القرارات أكتر من الأول", "score": 1},
            {"text": "عندي صعوبة في اخاذ القرارات", "score": 2},
            {"text": "مش قادر/ة اخد أي قرار خالص", "score": 3}
        ]
    },
    {
        "question": "شكلك في نظرك عامل إزاي؟",
        "answers": [
            {"text": "شكلي مش أسوأ من الأول", "score": 0},
            {"text": "قلقان/ة إني شكلي باين عليه الكبر أو مش جذاب", "score": 1},
            {"text": "حاسس/ة إن في تغييرات في شكلي خلتني مش جذاب/ة", "score": 2},
            {"text": "شايف/ة نفسي قبيح/ة", "score": 3}
        ]
    },
    {
        "question": "قدرتك على الشغل عاملة إزاي؟",
        "answers": [
            {"text": "بشتغل زي الأول", "score": 0},
            {"text": "محتاج/ة مجهود زيادة عشان أبدأ أي شغل", "score": 1},
            {"text": "بعمل مجهود جامد عشان أعمل أي حاجة", "score": 2},
            {"text": "مش قادر/ة أعمل أي شغل خالص", "score": 3}
        ]
    },
    {
        "question": "نومك عامل إزاي؟",
        "answers": [
            {"text": "بنام زي الأول", "score": 0},
            {"text": "مش بنام زي الأول", "score": 1},
            {"text": "بصحى بدري ساعة أو اتنين ومش بعرف أنام تاني", "score": 2},
            {"text": "بصحى بدري كتير ومش بعرف أنام تاني", "score": 3}
        ]
    },
    {
        "question": "بتحس/ي بتعب؟",
        "answers": [
            {"text": "مش بتعب أكتر من الأول", "score": 0},
            {"text": "بتعب بسرعة عن الأول", "score": 1},
            {"text": "بتعب من أي حاجة بعملها", "score": 2},
            {"text": "تعبان/ة جداً لدرجة مش قادر/ة أعمل أي حاجة", "score": 3}
        ]
    },
    {
        "question": "شهيتك للأكل عاملة إزاي؟",
        "answers": [
            {"text": "شهيتي للأكل زي الأول", "score": 0},
            {"text": "شهيتي مش حلوة زي الأول", "score": 1},
            {"text": "شهيتي أسوأ بكتير من الأول", "score": 2},
            {"text": "معدش عندي شهية خالص", "score": 3}
        ]
    },
    {
        "question": "وزنك اتغير؟",
        "answers": [
            {"text": "وزني تقريباً زي ما هو", "score": 0},
            {"text": "نقص أكتر من 2 كيلو", "score": 1},
            {"text": "نقص أكتر من 4 كيلو", "score": 2},
            {"text": "نقص أكتر من 6 كيلو", "score": 3}
        ]
    },
    {
        "question": "قلقان/ة على صحتك؟",
        "answers": [
            {"text": "مش قلقان/ة على صحتي أكتر من الأول", "score": 0},
            {"text": "قلقان/ة من أوجاع وتعب المعدة والإمساك", "score": 1},
            {"text": "قلقان/ة جداً على صحتي لدرجة صعب أفكر في حاجة تانية", "score": 2},
            {"text": "قلقان/ة جداً على صحتي لدرجة مش قادر/ة أفكر في أي حاجة تانية", "score": 3}
        ]
    },
   
]
all_questions = [
    {
        "question": "يا صاحبي/صاحبتي، نفسك عامله ايه النهاردة؟",
        "answers": [
            {"text": "تمام الحمدلله، مبسوط/ة", "score": 0},
            {"text": "مش أوي، في حاجة مضايقاني", "score": 1},
            {"text": "مخنوق/ة اوي", "score": 2},
            {"text": "تعبان/ة نفسياً جداً", "score": 3}
        ]
    },
    {
        "question": "بتنام/ي كويس ولا الدنيا مش ماشية؟",
        "answers": [
            {"text": "بنام عادي خالص", "score": 0},
            {"text": "النوم مش زي الأول", "score": 1},
            {"text": "بصحى كتير بليل", "score": 2},
            {"text": "مش عارف/ة أنام خالص", "score": 3}
        ]
    },
    {
        "question": "الأكل عامل معاك ايه؟",
        "answers": [
            {"text": "باكل عادي وشهيتي كويسة", "score": 0},
            {"text": "الأكل مش زي الأول", "score": 1},
            {"text": "مش باكل كويس", "score": 2},
            {"text": "مش عايز/ة اكل خالص", "score": 3}
        ]
    },
    {
        "question": "حاسس/ة بتعب إزاي؟",
        "answers": [
            {"text": "مش تعبان/ة", "score": 0},
            {"text": "بتعب بسرعة عن الأول", "score": 1},
            {"text": "تعبان/ة من أقل مجهود", "score": 2},
            {"text": "تعبان/ة جداً لدرجة مش قادر/ة أعمل حاجة", "score": 3}
        ]
    },
    {
        "question": "بتحس/ي بقلق أو توتر؟",
        "answers": [
            {"text": "نادراً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "كثيراً", "score": 2},
            {"text": "معظم الوقت", "score": 3}
        ]
    },
    {
        "question": "بتحب تقضي وقتك مع الناس ولا لوحدك؟",
        "answers": [
            {"text": "مع الناس", "score": 0},
            {"text": "أحياناً لوحدي", "score": 1},
            {"text": "أحب الوحدة", "score": 2},
            {"text": "أشعر بالراحة لوحدي", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاصر في حياتك؟",
        "answers": [
            {"text": "لا، أشعر بالحرية", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، أشعر بالضغط", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "كيف تقيم علاقتك بأصدقائك؟",
        "answers": [
            {"text": "علاقة ممتازة", "score": 0},
            {"text": "علاقة جيدة", "score": 1},
            {"text": "علاقة متوسطة", "score": 2},
            {"text": "علاقة سيئة", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة للمساعدة؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك أهداف تسعى لتحقيقها؟",
        "answers": [
            {"text": "نعم، لدي أهداف واضحة", "score": 0},
            {"text": "لدي بعض الأهداف", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "كيف تقيم مستوى طاقتك اليومية؟",
        "answers": [
            {"text": "عالي جداً", "score": 0},
            {"text": "مستوى جيد", "score": 1},
            {"text": "مستوى متوسط", "score": 2},
            {"text": "منخفض جداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالراحة في التعبير عن مشاعرك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير شيء في حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص تثق به لمشاركته مشاعرك؟",
        "answers": [
            {"text": "نعم، لدي شخص", "score": 0},
            {"text": "أحياناً أشارك", "score": 1},
            {"text": "نادراً ما أشارك", "score": 2},
            {"text": "لا، لا أشارك مع أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك تتقدم في حياتك؟",
        "answers": [
            {"text": "نعم، أشعر بالتقدم", "score": 0},
            {"text": "أحياناً أشعر بذلك", "score": 1},
            {"text": "لا، أشعر بالركود", "score": 2},
            {"text": "لا، أشعر بالتراجع", "score": 3}
        ]
    },
    {
        "question": "هل لديك خطط للمستقبل؟",
        "answers": [
            {"text": "نعم، لدي خطط واضحة", "score": 0},
            {"text": "لدي بعض الخطط", "score": 1},
            {"text": "لا أعرف ما أريد", "score": 2},
            {"text": "لا، أشعر بالضياع", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لتغيير نمط حياتك؟",
        "answers": [
            {"text": "لا، أنا راضٍ", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج لتغيير", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك شخص يمكنك الاعتماد عليه؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، لا أستطيع الاعتماد على أحد", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص إيجابيين؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بالقلق عند التفكير في المستقبل؟",
        "answers": [
            {"text": "لا، أبداً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نعم، كثيراً", "score": 2},
            {"text": "نعم، أشعر بالخوف", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت لممارسة هواياتك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك بحاجة لمساعدة نفسية؟",
        "answers": [
            {"text": "لا، أنا بخير", "score": 0},
            {"text": "أحياناً أفكر في ذلك", "score": 1},
            {"text": "نعم، أحتاج للمساعدة", "score": 2},
            {"text": "نعم، أشعر باليأس", "score": 3}
        ]
    },
    {
        "question": "هل لديك وقت للاسترخاء في يومك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل تشعر بأنك محاط بأشخاص يدعمونك؟",
        "answers": [
            {"text": "نعم، دائماً", "score": 0},
            {"text": "أحياناً", "score": 1},
            {"text": "نادراً", "score": 2},
            {"text": "لا، أبداً", "score": 3}
        ]
    },
    {
        "question": "هل لديك أنشطة تحب القيام بها؟",
        "answers": [
            {"text": "نعم، كثير من الأنشطة", "score": 0},
            {"text": "بعض الأنشطة", "score": 1},
            {"text": "قليل من الأنشطة", "score": 2},
            {"text": "لا، لا أستمتع بشيء", "score": 3}
        ]
    }
]   